tap "borkdude/brew"
tap "d12frosted/emacs-plus"
tap "ggozad/formulas"
tap "homebrew/services"
tap "sst/tap"
tap "tektoncd/tools"
tap "tmspzz/tap"
brew "age"
brew "xz"
brew "jpeg-xl"
brew "gcc"
brew "harfbuzz"
brew "aider"
brew "aria2"
brew "boost"
brew "docbook"
brew "source-highlight"
brew "asciidoc"
brew "asciidoctor"
brew "git"
brew "asdf"
brew "aspell"
brew "aws-iam-authenticator"
brew "awscli"
brew "bash-completion@2"
brew "bat"
brew "binutils"
brew "carthage"
brew "chezmoi"
brew "chezscheme"
brew "cloc"
brew "rlwrap"
brew "clojure"
brew "clojure-lsp"
brew "cmake"
brew "cmake-docs"
brew "cocoapods"
brew "ripgrep"
brew "codex"
brew "coreutils"
brew "dart-sdk"
brew "datamash"
brew "diffutils"
brew "direnv"
brew "docutils"
brew "fmt"
brew "gflags"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "eza"
brew "fd"
brew "tesseract"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "gawk"
brew "gh"
brew "gimme-aws-creds"
brew "gist"
brew "git-absorb"
brew "git-big-picture"
brew "git-cal"
brew "git-cliff"
brew "git-crypt"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "git-machete"
brew "git-multipush"
brew "git-open"
brew "git-quick-stats"
brew "gitlint"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-units"
brew "gnu-which"
brew "gnupg"
brew "qt"
brew "gnuplot"
brew "go"
brew "gradle"
brew "grc"
brew "grip"
brew "guile"
brew "gzip"
brew "hatch"
brew "imagemagick"
brew "isort"
brew "ispell"
brew "jansson"
brew "jc"
brew "jet"
brew "jj"
brew "jq"
brew "jsonlint"
brew "k9s"
brew "kubernetes-cli"
brew "lefthook"
brew "leiningen"
brew "lesspipe"
brew "llvm"
brew "lnav"
brew "lorem"
brew "magic-wormhole"
brew "mailutils"
brew "markdown"
brew "markdownlint-cli"
brew "maven"
brew "md5deep"
brew "yt-dlp"
brew "mpv"
brew "mvfst"
brew "netcat"
brew "nmap"
brew "nvm"
brew "openssh"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "pngpaste"
brew "poetry"
brew "poppler"
brew "prettier"
brew "proctools"
brew "proto"
brew "psgrep"
brew "pstree"
brew "pyenv"
brew "pygments"
brew "pyright"
brew "qrencode"
brew "rbenv"
brew "rsync"
brew "ruff"
brew "rust"
brew "rye"
brew "s-search"
brew "sbcl"
brew "screen"
brew "shellcheck"
brew "shfmt"
brew "six"
brew "sops"
brew "sphinx-doc"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "stylelint"
brew "swi-prolog"
brew "telegraf", restart_service: :changed
brew "terminal-notifier"
brew "tokei"
brew "tree"
brew "tree-sitter"
brew "unzip"
brew "vale"
brew "vim"
brew "viu"
brew "volta"
brew "watch"
brew "watchman"
brew "wdiff"
brew "wget"
brew "wordnet"
brew "xcbeautify"
brew "xcodes"
brew "xmlto"
brew "yamllint"
brew "yarn"
brew "ykman"
brew "yq"
brew "zoxide"
brew "borkdude/brew/babashka"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-imagemagick", "with-mailutils", "with-savchenkovaleriy-big-sur-3d-icon"]
brew "sst/tap/opencode"
brew "tektoncd/tools/tektoncd-cli"
brew "tmspzz/tap/rome"
cask "1password"
cask "1password-cli"
cask "anythingllm"
cask "appcleaner"
cask "arc"
cask "audio-hijack"
cask "betterdisplay"
cask "diffusionbee"
cask "discord"
cask "dropbox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-metropolis"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-noto-color-emoji"
cask "font-roboto-condensed"
cask "font-roboto-mono"
cask "ghostty"
cask "github"
cask "gpg-suite"
cask "helium"
cask "iterm2"
cask "kdiff3"
cask "keybase"
cask "lm-studio"
cask "mactex"
cask "macwhisper"
cask "meld"
cask "notion-mail"
cask "ollama-app"
cask "onyx"
cask "orbstack"
cask "quarto"
cask "raycast"
cask "rectangle"
cask "skim"
cask "temurin"
cask "temurin@11"
cask "temurin@17"
cask "thunderbird"
cask "twobird"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "zoom"
cask "zulip"
cask "brave-browser"
cask "zen"
cask "vivaldi"
cask "sigmaos"
